Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: In the current Rakudo implementation, the second line with say will print a higher number than the first.
ja: 現在のRakudo実装では、sayによる第二行は、最初より高い数を出力するでしょう。

source: In the first call of a(3), the nominal types alone already determine the best candidate match, so the where block never executes and the first $counter output is always 0.
ja: a(3)の最初の呼び出しで、名目型は最善の候補マッチをすでに決定します。なのでブロックは実行されず、最初の$counter出力は常に0です。

source: In the first iteration %sets{$p1} is not yet set, so it defaults to a special value called Any.
ja: 最初の繰り返しにおいて、%sets{$p1}はまだセットされていないので、それはデフォルトでAnyと呼ばれる特別な値になります。

source: In the line:
ja: 行の中で：

source: In the previous example, $<dup> is a shortcut for $/<dup> or $/{ 'dup' }.
ja: 前の例の$<dup>は$/<dup>または$/{ 'dup' }のためのショートカットです。

source: In the previous example, the line-and-column function determines the line number in which the match occurred by extracting the string up to the match position ($m.orig.substr(0, $m.from)), splitting it by newlines, and counting the elements.
ja: 前の例でline-and-column関数は文字列をマッチ位置（$m.orig.substr(0, $m.from)）まで抽出し、改行文字で分割し、要素を数えることで行数を決定します。

source: In the previous examples, the comparisons are numeric, string, and range, respectively.
ja: 前の例にはそれぞれ、比較は数字、文字列とレンジです。

source: In the score counting program, %matches stores the number of matches each player has won.
ja: スコア計算プログラムでは、%matchesは各々のプレーヤーが勝った試合の数を格納します。

source: In theory, any user-defined control construct can catch any control exception it likes.
ja: 理論的には、どれか一つのユーザー定義の制御構造はそれのように制御例外をキャッチできる。

source: In these cases, it makes sense to restrict the types of parameters, such that attempts to pass incorrect values as arguments will cause Perl to raise an error at the time of calling the subroutine, or even at the compile time, if the compiler is smart enough to catch that (footnote: at the time of writing, Rakudo recognizes type mismatches for literals and explicitly typed variables).
ja: これらの場合、パラメータの方を制限することは不正な値を引数として渡した時にPerlがサブルーチン呼び出し時かコンパイル時にエラーを起こすのに十分スマートなコンパイラであるときに意味をなします（注釈：これを書いている時点ではRakudoはリテラルと明示的に型指定した変数の方の不一致を認識します）。

source: In this case the captures occur in the same order as they are in the regex, but quantifiers can change that.
ja: この場合、キャプチャーはそれらの正規表現と同じ順序で起こります。しかし数量詞はそれを変えることができます。

source: In this case the objects are pairs.
ja: この場合、オブジェクトはペアです。

source: In this case, it is often easier to pass the arguments by name.
ja: このような場合、大抵は引数を名前で渡すと簡単です。

source: In this case, it is possible to mark the parameter as optional.
ja: この場合、パラメータを任意としてマークすることが可能です。

source: In this case, it makes little sense to compose both of the roles into a class.
ja: この場合、それは両方のロールをクラスに合成するために小さく意味をなします。

source: In this case, the ! twigil emphasizes that this attribute is private to the class.
ja: この場合、! twigilは属性がクラスにプライベートであることを強調します。

source: In this case, the amount and types of the function's arguments help to distinguish between the variants of a function.
ja: この場合、関数の引数の量と型は関数の異形を区別するのを助けます。

source: In this case, the regex engine backs up and attempts to match another alternative or matches one fewer character of the quantified portion to see if the overall regex succeeds.
ja: この場合、正規表現エンジンはバックして、全ての正規表現が成功するか見るために他の選択肢にマッチするか、数量化された1つ少ない文字の部分にマッチします。

source: In this case, the slurpy should come last.
ja: その場合、slurpyは最後にくるべきです。

source: In this case, you may add an additional constraint to the parameter with a where block:
ja: この場合、更なる制約をwhereブロックで追加できます：

source: In this example, dup calls the word regex, then matches at least one non-word character, and then matches the same string as previously matched by the regex word.
ja: この例では、dupはword正規表現を呼び、そして少なくとも1つの非語文字にマッチし、そして前もって正規表現wordによってマッチした同じ文字列とマッチします。

source: In this example, the TOP rule anchors the match to the start (with ^) and end of the string (with $), so that the whole string has to be in valid JSON format for the match to succeed.
ja: この例ではTOPルールは文字列の始まり（^）と終わり（$）にマッチを固定するので、全部の文字列はマッチに成功するために有効なJSONフォーマットでなければなりません。

source: In this game, that fourth candidate matches only for two objects of the same type.
ja: このゲームにおいて、その第4候補は同じ型の2つのオブジェクトとマッチするだけです。

source: In this grammar, a call to <value> matches either one of the newly added alternatives, or any of the old alternatives from the parent grammar JSON::Tiny::Grammar.
ja: このグラマーにおいて<value>の呼び出しは、新しく追加された選択肢、または親グラマーJSON::Tiny::Grammarからの古い選択肢のどれかにマッチします。

source: In this line, it's the argument provided to open.
ja: この行では、それはopenに与えられる引数です。

source: In this minimal JSON grammar, whitespace is never mandatory, so ws can match nothing at all.
ja: この最小のJSONグラマーにおいて空白は決して必須でないので、wsはまったく何にもマッチすることができません。

source: In those situations, the order of inheritance or mixin decides which method wins.
ja: それらの状況では、継承またはミックスインの順序がどのメソッドが勝つかについて決めます。

source: In turn a value can be an array.
ja: 一方でvalueはarrayでありえます。

source: Inheritance
ja: 継承

source: Inherited grammars may also add variants to proto tokens:
ja: 継承されたグラマーは、可変要素もプロトトークンに加えます：

source: Inside a character class, non-word characters do not need to be escaped, and generally lose their special meaning.
ja: 文字クラスの中で非ワード文字はエスケープされる必要はなく、通常はそれらの特別な意味を失います。

source: Inside the CATCH block, the exception in question is bound to $_.
ja: CATCHブロック内部で、問題の例外は$_にバインドされる。

source: Inside the method, that happens:
ja: メソッド内でそれは起きます：

source: Instead do {...} is the do-once loop (which is another reason you can't put a statement modifier on it; use repeat for a test-at-the-end loop).
ja: 代わりにdo {...}はdo-onceループだ（それは文修飾子を置くことができないもう一つの理由だ；repeatをtest-at-the-endループのために使え）。

source: Instead it redispatches to overloadable multi methods.).
ja: 代わりにそれはオーバーロード可能なマルチメソッドを再ディスパッチします）。

source: Instead of applying multiple roles to an instance, compose them into a new role at compile time and apply that role to the instance.
ja: 複数のロールをインスタンスに適用する代わりに、それらをコンパイル時に新しいロールに合成し、そのロールをインスタンスに適用してください。

source: Instead of binding to an array parameter, it instead unpacks its arguments into several parameters--in this case, a scalar for the first element and an array for the rest.
ja: 配列パラメータにバインドする代わりに、それはいくつかのパラメータに引数をアンパックします ― この場合、最初のスカラーと残りが配列です。

source: Instead of the ! twigil, this twigil is ..
ja: ! twigilの代わりにこのtwigilは.です。

source: Instead of writing eat(@food[0], @food[1], @food[2], ...) and so on, you can flatten them into the argument list by prepending it with the vertical bar or "pipe" character (|): eat(|@food).
ja: eat(@food[0], @food[1], @food[2], ...)のように書く代わりに、その引数リストの前に「パイプ」文字（|）をつけることによってフラット化できます：eat(|@food)。

source: Instead, the candidates from all of the roles will combine during role composition.
ja: その代わりに、ロールからのすべての候補はロール合成の間で組み合わさるでしょう。

source: Instead, use a NEXT block within the body of the loop.
ja: 代わりに、NEXTブロックをループの本体内で使う。

source: Instead, you should write the more Pascal-like repeat loop:
ja: 代わりとして、よりパスカル的なrepeatループを書くべきだ：

source: Interpolating Arrays and Hashes
ja: 配列とハッシュの展開

source: Introspection
ja: イントロスペクション

source: Introspection is the process of gathering information about some objects in your program, not by reading the source code, but by querying the object (or a controlling object) for some properties, like its type.
ja: イントロスペクションはソースコードを読むことによってでなく、いくつかのプロパティ（その型のような）のためにオブジェクト（またはコントロールしているオブジェクト）に問い合わせることによって、あなたのプログラムのいくつかのオブジェクトに関する情報を収集するプロセスです。

source: Introspection is very useful for debugging, and for learning the language and new libraries.
ja: イントロスペクションはデバッギングのために、そして言語と新しいライブラリを学ぶために非常に有用です。

source: Invariant sigils
ja: 不変のシギル

source: Invert the sense of each of these backslash sequences by uppercasing its letter: \W matches a character that's not a word character and \N matches a single character that's not a newline.
ja: その文字を大文字に換えることによって、これらのバックスラッシュシーケンスの各々の意味を逆にします：\Wはワード文字でない文字にマッチします。そして\Nは改行文字でない一つの文字にマッチします。

source: Is that necessary?
ja: それは必要ですか？

source: Is there a rephrasing that's more correct?
ja: より正しい言い直しはありますか？

source: Is there a way to prevent cycles from ever forming through add-dependency?
ja: 循環がadd-dependencyを通して形をなすのを防ぐ方法がありますか？

source: Is this a little too cute?
ja: これは少しばかりかわいいですか？

source: It accesses the match object that the regex dup produced.
ja: それは正規表現dupが作り出したマッチオブジェクトにアクセスします。

source: It also fixes the subsequent example.
ja: それも以降の例を解決します。

source: It also includes tests and documentation.
ja: テストとドキュメントも含んでいます。

source: It also makes the try keyword redundant, because any block can function as a try block if you put a CATCH block within it.
ja: それはまたtryキーワードを冗長にさせる。なぜならどんなブロックでもCATCHブロックを中に置けばtryブロックとして機能できるからだ。

source: It begins harmlessly with a variable declaration my $label-area-width and an assignment.
ja: それは当り障りのない変数宣言my $label-area-widthと割り当てで始まります。

source: It binds the nominal type of the first argument to T, which can then act as a type constraint.
ja: それは最初の引数の名目タイプをTに結びつけます。それからそれは型制約の働きをすることができます。

source: It calculates the column by searching backwards from the match position and calculating the difference to the match position.
ja: それはマッチ位置から後方に検索し、マッチ位置との違いを計算することで列を計算します。

source: It contained the statement %matches{$p1}++;.
ja: それはステートメント%matches{$p1}++;を含んでいました。

source: It contains no type definition, in which case the type of the parameter defaults to Any, the root of the normal branch of the type hierarchy.
ja: それは型定義を含まず、その場合にはパラメータの型はデフォルトでAny（型階層の通常の分岐の根元）になります。

source: It does so by tracking its numerator and denominator as integers, so mathematical operations on Rats with large components can become quite slow.
ja: それは分子と分母を整数としてトラッキングすることによって行うので、大きな構成要素によるRatの数値演算はかなり遅くなります。

source: It does this again by recursing into to-json.
ja: それはto-jsonの再帰によって再び行います。

source: It doesn't matter where in the capture the named arguments appear, because they are passed by name, not by position.
ja: 名前付き引数がどこにあるか気にする必要はありません。なぜならそれは位置ではなく名前で渡されるからです。

source: It either returns an unthrown exception, or throws the exception.
ja: それはスローされない例外または例外をスローする。

source: It embraces several paradigms like procedural, object oriented, and functional programming, and offers powerful tools for parsing text.
ja: それは手続き的で、オブジェクト指向で、関数プログラミングのようないくつかのパラダイムを受け入れて、テキストを解析することに対して強力なツールを提供します。

source: It ends with another word boundary.
ja: それは、別の語境界で終わります。

source: It has dependent tasks:
ja: それは、従属する仕事を持っています：

source: It is a little bit like the empty () list, insofar as both represent an absence of values, except that () is defined and means "there are 0 arguments here if you're counting that low".
ja: それは両方が値の欠如を表す限りにおいて空の()リストに少し似ています。()は定義されていて“引数はない”という意味を表すのを除いて。

source: It is a series of tutorials, not a comprehensive reference.
ja: それは一連のチュートリアルで、包括的なリファレンスではありません。

source: It is also a Unicode character.
ja: それはUnicode文字でもあります。

source: It is also possible to write a signature that binds the capture itself into a variable.
ja: 変数にキャプチャー自体を結びつけるシグネチャーを書くことも可能です。

source: It is called every time the script is run, and its signature counts as a specification for command line arguments.
ja: それはスクリプトが動かされるたびに呼ばれます。そして、そのシグネチャーはコマンドライン引数のための仕様とされます。

source: It is given as a trait of the variable:
ja: それは変数のトレイトとして与えられます：

source: It is hard to catch such errors by re-reading your own text, but Perl can do it for you using regex:
ja: 自身のテキストを再読することによってそのようなエラーを捕えることは難しいです。しかしPerlはregexを用いてそれをすることができます：

source: It is illegal to return from the closure if that Routine no longer owns a call frame in the current call stack.
ja: Routineが現在のコールスタックでもうコールフレームを所持していないならクロージャから戻るのは不当だ。

source: It is part of the libary JSON::Tiny, which is available from http://github.com/moritz/json/.
ja: それはJSON::Tinyライブラリの一部で、http://github.com/moritz/json/から入手可能です。

source: It is possible to fail with a resumable exception, such as a warning.
ja: 警告のように、再開可能な例外と共に失敗することが可能だ。

source: It is the same as:
ja: それは以下と同じになります：

source: It may either be provided by the class itself, by another role, or by a parent class.
ja: それはクラス自体によって、別のロールによって、または親クラスによって提供されます。

source: It may operate on provided data (arguments) and may produce results (return values).
ja: それは供給されたデータ（引数）に作用することができて、結果（返り値）を生み出します。

source: It means "there is no value here".
ja: それは「ここに値はない」ことを意味します。

source: It merely assigns an undefined Dog prototype object to $spot:
ja: それは単に未定義のDogプロトタイプオブジェクトを$spotに割り当てるだけです：

source: It must bind the two arguments as rw--both readable and writable.
ja: それはrw ― 読み書き可能で ― として2つの引数を結びつけなければなりません。

source: It represents a major break in syntactic and semantic compatibility from Perl 5, thus the increase from 5 to 6.
ja: それはPerl 5の構文と意味論の互換性との大きな決別を表しています。

source: It returns True for handled exceptions and for all non-Failure objects.
ja: それはハンドルされる例外と全ての非FailureオブジェクトのためにTrueを返す。

source: It returns both the captured and the non-captured part of the matched string, in the same format as caps, but with a tilde ~ as key.
ja: それはマッチした文字列のキャプチャーされた部分とされない部分両方をcapsと同じフォーマットで返します。しかし~がキーに付きます。

source: It showcases custom constructors, private and public attributes, methods and various aspects of signatures.
ja: それは、シグネチャーのカスタムコンストラクタ、プライベートとパブリック属性、メソッドといろいろな側面を公開します。

source: It stores sign, mantissa, and exponent, each with a fixed width.
ja: それは、符号、仮数と指数（固定幅による各々）を格納します。

source: It supports arrays, hashes, numbers, strings, boolean values, and null, the undefined value.
ja: それは配列、ハッシュ、数、文字列、ブール値とnull（未定義値）をサポートします。

source: It takes a format string, which specifies how to print the following parameters.
ja: それは書式文字列を受け取り、以下のパラメータをどのように出力するか指定します。

source: It takes a string on the left-hand side and a number on the right-hand side, and sticks the strings together as many times as the number specifies, so 'ab' x 3 returns the string 'ababab'.
ja: それは左側に文字列、右側に数値を取り、指定回数の文字列を繰り返します。なので'ab' x 3は文字列'ababab'を返します。

source: It takes no parameters, working instead with the object's attributes.
ja: それはパラメータをとりません。そして、オブジェクトの属性でその代わりに作業します。

source: It turns the single string 'Beth Ana Charlie Dave' into the list of strings 'Beth', 'Ana', 'Charlie', 'Dave'.
ja: それは1つの文字列'Beth Ana Charlie Dave'を文字列のリスト'Beth', 'Ana', 'Charlie', 'Dave'に変えます。

source: It works exactly like temp, except that the value will be restored only if the current block exits unsuccessfully.
ja: 現在のブロックを失敗して抜ける場合だけ値が復元されることを除き、ちょうどtempのよに動作する。

source: It's a $ sandwich.
ja: それは$サンドイッチです。

source: It's also ok to have a method call between the variable name and the postcircumfix.
ja: 変数名と後置接周辞の間でメソッドを呼び出してもいいです。

source: It's also possible to conceive of an XML node type that is a type of capture, with named attributes and positional children.
ja: キャプチャー型の名前付き属性とポジショナルな子を持つXMLノード型を想像することもできます。

source: It's always spelled for in Perl 6, so it always takes a list as an argument:
ja: Perl 6では常にforと綴られるので、常に引数としてリストを取る：

source: It's as if you had written an anonymous subclass of the current class of the object that composed the role into it.
ja: それは、ロールと合成したオブジェクトの現在のクラスの匿名のサブクラスをあなたが書いていたかのようです。

source: It's as if you had written:
ja: それは次のように書いたかのようです：

source: It's even a bit cleverer than that: between two word characters whitespace is mandatory.
ja: これはそれよりも少し巧妙です：2つのワード文字の間の空白は必須です。

source: It's not an error to pass parameters to such a block either:
ja: そのようなブロックにパラメータを渡すのはどちらもエラーではない：

source: It's not very much code, and yet the result is interesting and, at times, useful.
ja: それはあまりコードでありませんが、結果は面白くて、時々役に立ちます。

source: It's only important right now to notice that the classes KarmaKeeper and NothingBot share some behavior by inheriting from IRCBot and differentiate their behaviors by performing different roles.
ja: 今重要なのはクラスKarmaKeeperとNothingBotがIRCBotから継承することによっていくらかの振る舞いを共有して、異なるロールを実行することによって彼らの振る舞いを区別していることに気付くことです。

source: It's somewhat like virtual methods where the actual call depends on the type of the invocant, but here the "invocant" is really the lexical scope of the caller, and the virtual calls are name bindings.
ja: これは実際の呼び出しがインボカントの型に依存する場所ではやや仮想メソッドのようだ。しかしここではインボカントは呼び出し元の実際のレキシカルスコープで、仮想呼び出しは名前にバインドされている。

source: It's still strong in text processing, but Perl 5 is also a powerful general-purpose programming language.
ja: それはいまだにテキスト処理において強力です。しかしPerl 5は強力な多目的プログラミング言語でもあります。

source: It's time to introduce the augment syntax.
ja: augment構文を導入する時です。

source: Iterations that return () (such as by calling next with no extra return arguments) return that () as the next value, which will therefore disappear when interpolated in flat context, but will interpolate an empty Parcel into slice context.
ja: ()を返す反復（nextを余分なリターン引数なしに呼ぶような）は()を次の値として返す。それによってフラットコンテキストに保管された時に見えなくなる。しかしスライスコンテキストでは空のParcelを補完する。

source: Its body consists of a single say statement.
ja: その本体は1つのsay文から成ります。

source: Its signature is empty.
ja: それのシグネチャーは空です。

source: Javascript Object Notation (JSON) is a simple data exchange format often used for communicating with web services.
ja: Javascript Object Notation（JSON）はウェブサービスと通信するために使われるシンプルなデータ交換形式です。

source: Just as Perl borrows good ideas from other languages, so Perl 5 and Perl 6 share features.
ja: Perlが他の言語から良い考えを借りるちょうどその時、Perl 5とPerl 6は機能を共有します。

source: Just as a my variable can not be accessed from the outside of its declared scope, attributes are not accessible outside of the class.
ja: my変数が宣言されたスコープの外側からアクセス出来ないように、属性はクラスの外からアクセスできません。

source: Just as in the case of +=, if either hash value did not exist previously, it is autovivified by the increment operation.
ja: ちょうど+=の場合のようにどちらのハッシュ値も前もって存在しないならば、それはインクリメント演算子によって自動生成されます。

source: Just as subclasses inherit methods from superclasses, so grammars inherit rules from its base grammar.
ja: サブクラスがスーパークラスからメソッドを継承するように、グラマーはそのベース文法からルールを継承します。

source: Just as the * quantifier in regexes means "zero or more", the .* dispatch operator will call zero or more matching methods.
ja: 正規表現の*数量詞が0以上を意味するように、.*ディスパッチ演算子は0以上のマッチするメソッドを呼ぶでしょう。

source: Just as you rarely think of a signature as a whole--instead focusing on individual parameters--you rarely have to think about captures.
ja: あまり考えることのないシグネチャーの全体 ― 個々のパラメータに着目する代わりに ― キャプチャーについて考える必要があるのはまれです。

source: Just like "Nil", type objects do not disappear in list context, but rely on something downstream to catch it or blow up.
ja: "Nil"のように、型オブジェクトはリストコンテキストでは消えず、下流の何かに頼って捕らえるかブローアップします。

source: Just like == converts its arguments to numbers before comparing, eq as an infix operator compares for string equality, converting its arguments to strings as necessary:
ja: ==が比較の前に引数を数値に変換するように、接中辞演算子としてのeqは文字列が同等か比較します。必要なら引数を文字列に変換します：

source: Just like @variable.method calls a method on @variable, @array».method calls a method for each item in @array and returns the list of the return values.
ja: @variable.methodが@variableでメソッドを呼ぶように、@array».methodは@arrayの各々のアイテムにメソッドを呼び出して結果の値のリストを返します。

source: Just like @variable.method calls a method on @variable, @arrayｻ.method calls a method for each item in @array and returns the list of the return values.
ja: @variable.methodが@variableに対してメソッドを呼び出すのと同様に、@array».methodは@arrayの各々のアイテムに対してメソッド を呼び出し、返り値のリストを返します。

source: Keep in mind that the number of times the subtype checks blocks execute is specific to any particular implementation of Perl 6.
ja: サブタイプがブロックが実行することを確認する回数がPerl 6の何の特定の実装に特有なことを心にとめておいてください。

source: Large projects written in such systems often have complex interactions and workarounds for classes which want to reuse code but do not want to take on additional unnecessary capabilities.
ja: しばしばそのようなシステムで書かれる大きなプロジェクトでは、クラスのために複雑な対話処理と回避方法を持っています。そのクラスは再利用したいが、さらなる不必要な機能を引き受けたくはありません。

source: Lastly, the :T adverb can be used to indicate that the parameter may only be given as a type object.
ja: 最後に、:T副詞はパラメータが型オブジェクトだけであることを示すのに使うことができます。

source: Less obviously, so does a gather; if a gather lexically contains any take calls, it is marked as lexotic-only, and it will be invisible to a dynamic take.
ja: あまり明らかでない、それゆえgatherを行う；もしgatherが何か一つのtake呼び出しをレキシカルに含んでいるなら、それはlexotic-onlyとしてマークされる。そしてダイナミックなtakeには不可視になる。

source: Lexical Conventions
ja: レキシカルの規則

source: Lexical variables are visible only in the current block from the point of declaration to the end of the block.
ja: レキシカル変数は、現在のブロック内で宣言した場所からブロックの終端までしか見えません。

source: Lexicals may not "leak" from a block to any other external scope (at least, not without some explicit aliasing action on the part of the block, such as exportation of a symbol from a module).
ja: レキシカルはブロックから他の外部スコープへは「リーク」しない（少なくともモジュールからのシンボルのエクスポートのような、ブロック部分のいくつかの明示的なエイリアシングが無い場合）

source: Lexotic operators in Perl 6 include:
ja: Perl 6のレギゾチック演算子は以下を含む：

source: Like do, it is followed by a statement or block, and executes it once.
ja: doのように、それには文かブロックが続き、一回実行する。

source: Like arrays and hashes, a Capture can be flattened into an argument list using |:
ja: 配列やハッシュのように、Captureは|を使って引数リストにフラット化できます。

source: Like classes, a role can contain methods (including named regexes) and attributes.
ja: クラスのように、ロールはメソッド（名前付き正規表現を含む）と属性を含むことができます。

source: Like most other modern programming languages, Perl 6 gives you the option of explicitly specifying the return type of a subroutine.
ja: 現代の大部分の他のプログラミング言語のように、Perl 6はあなたにサブルーチンの戻り値の型をはっきりと指定する選択権を与えます。

source: Like other languages that have adopted a similar syntax to C, Perl 6 allows for a shorthand way to write certain assignments.
ja: C言語に類似した構文を採用した他の言語のように、Perl 6は特定の割当てを書くための短縮形を書くことができます。

source: Likewise any subscripting operation on Nil returns Nil.
ja: 同様にNilでの添字付け演算子もNilを返します。

source: Likewise you can unpack a hash by using %(...) instead of square brackets, but you must access named parameters instead of positional.
ja: 同様に、あなたはブラケットの代わりに%(...)を用いてハッシュを取り出すことができます。しかし、位置依存パラメータの代わりに名前付きパラメータにアクセスしなければなりません。

source: Likewise, temporization is never needed for statement_control:<for> because it always calls a closure.
ja: 同様に、statement_control:<for>のためにテンポラリー化は決して必要ない。なぜならそれは常にクロージャを呼び出すからだ。

source: Likewise, there is a data structure that holds a collection of arguments, named a Capture.
ja: 同様に引数のコレクションを持つデータ構造があり、Captureと呼ばれます。

source: Likewise, we can just remember the gather's result parcel by binding and later coercing it:
ja: 同様に、我々はちょうどgatherの結果のパーセルをバインドと後での強制によって覚えることができる：

source: Likewise, you can interpolate hashes into named arguments:
ja: 同様に、名前付き引数でハッシュを展開できます：

source: Likewise, you can write [+] to get the sum of a list of values, [*] for the product, and [<=] to check if a list is ordered by ascending values.
ja: 同様に[+]をリストの値の合計を得るため、[*]は積、[<=]をリストが昇順に並んでいるか調べます。

source: Link to Any discussion.
ja: Anyの議論と関連付けてください。

source: Link to exporting section.
ja: エクスポートセクションと関連付けてください。

source: Link to traits section.
ja: トレイトセクションと関連付けてください。

source: List of names a named parameter can be passed as
ja: 渡すことができる名前付きパラメータのリスト

source: List stringification
ja: リストの文字列化

source: Lists and Hashes
ja: リストとハッシュ

source: Literals
ja: リテラル

source: Long form
ja: 長い形式

source: Look at the KarmaKeeper class declaration.
ja: KarmaKeeperクラス宣言を見てください。

source: Looking at the grammar, you'll also note that there are also token declarations as well.
ja: グラマーを見て、あなたは同様にtoken宣言がある点にも注意するでしょう。

source: Loop commands like next are abnormal, but looping because you hit the end of the block is not.
ja: nextのようなループコマンドはアブノーマルだ。しかしあなたがブロックの終端をヒットするルーピングは違う。

source: Loop modifiers next, last, and redo also work much as in Perl 5.
ja: ループ修飾子next、last、redoもPerl 5と同様に動作する。

source: Loop statements
ja: ループ文

source: Looping statement modifiers are the same as in Perl 5 except that, for ease of writing list comprehensions, a looping statement modifier is allowed to contain a single conditional statement modifier:
ja: ループ文修飾子はPerl 5と同様だ。リストを書く可読性のために、ループ文修飾子はひとつの条件文修飾子を含むことが許可されることを除けば：

source: Many constructs define a particular interplay of lexical and dynamic features.
ja: 多くの構成物がレキシカルとダイナミックの機能の特定の相互作用を定義する。

source: Many of the special variables of Perl 5 are going away.
ja: Perl 5の多くの特殊変数は無くなります。
